Repository: FlutterAppGemini/App_LearnQuest
Catalog: lib/l10n/intl_*.arb
Languages: es

# gemini_create_course_prompt
source: Generate a course on the topic '{topic}'. Expected structure for a new course: { "title": "title", "icon": "icon from the list: {iconList}", "color": "A string representing a color in hexadecimal format (without the hash sign)", "description": "Brief description of the subject or what will be covered", "lessons": [ { "title": "Lesson title", "content": "Detailed lesson content, provided in a clear and example-driven manner", "game": [ { "question": "Question 1", "response": [ "Answer 1", "Answer 2", "Answer 3", "Answer 4", "Answer 5" ], "solution": "Answer 1" } ] } ] } Expected structure for a lesson continuation: { "title": "Title of the next lesson", "content": "Detailed content for the entire lesson, with clear examples", "progress": 0.0, "game": [ { "question": "Question 1", "response": [ "Answer 1", "Answer 2", "Answer 3", "Answer 4", "Answer 5" ], "solution": "Answer 1" } ] }
es: Genera un curso sobre el tema '{topic}'.

# gemini_system_instruction
source: Expected structure for a new course: { "title": "title", "icon": "icon from the list: {iconList}", "color": "A string representing a color in hexadecimal format (without the hash sign)", "description": "Brief description of the subject or what will be covered", "lessons": [ { "title": "Lesson title", "content": "Detailed lesson content, provided in a clear and example-driven manner", "game": [ { "question": "Question 1", "response": [ "Answer 1", "Answer 2", "Answer 3", "Answer 4", "Answer 5" ], "solution": "Answer 1" } ] } ] } Expected structure for a lesson continuation: { "title": "Title of the next lesson", "content": "Detailed content for the entire lesson, with clear examples", "progress": 0.0, "game": [ { "question": "Question 1", "response": [ "Answer 1", "Answer 2", "Answer 3", "Answer 4", "Answer 5" ], "solution": "Answer 1" } ] } 1. When requesting an initial course on a topic, the response should follow the first structure. 2. When requesting a continuation of a lesson on a topic, the response should follow the second structure. 3. "game" is an array of questions (between 5 and 8). 4. "response" is an array of answers (between 4 and 7), where one is correct and should be specified as a string in "solution". 5. When requesting a new lesson for a previously given topic, the content should advance incrementally, avoiding repetition of previous lessons, and keeping the content clear and well-explained. 6. Do not include images or links.
es: Estructura esperada para un curso nuevo: { "title": "titulo", "icon": "icono de la lista: {iconList}", "color": "es un String que representa un color pero en sistema hexadecimal(no incluyas el numeral)", "description": "descripcion breve de la materia o lo que se verá", "lessons": [ { "title": "titulo de la leccion", "content": "contenido de toda la leccion, información a modo de texto, lo más detallado y con ejemplos claros", "game": [ { "question": "pregunta 1", "response": [ "respuesta 1", "respuesta 2", "respuesta 3", "respuesta 4", "respuesta 5" ], "solution": "respuesta 1" } ] } ] } Estructura esperada para la continuación de una lección: { "title": "titulo de la lección siguiente", "content": "contenido de toda la lección, información a modo de texto, lo más detallado y con ejemplos claros", "progress": 0.0, "game": [ { "question": "pregunta 1", "response": [ "respuesta 1", "respuesta 2", "respuesta 3", "respuesta 4", "respuesta 5" ], "solution": "respuesta 1" } ] } 1. Al solicitar un curso inicial sobre un tema, la respuesta debe seguir la primera estructura. 2. Al solicitar la continuación de una lección sobre un tema, la respuesta debe seguir la segunda estructura. 3. "game" es un array de preguntas (entre 5 y 8). 4. "response" es un array de respuestas (entre 4 y 7) donde 1 es correcta e irá como String en "solution". 5. Al solicitar una nueva lección para un tema ya dado, se debe proporcionar contenido que avance de manera incremental, asegurando no repetir lecciones anteriores y mantener el contenido claro y bien explicado. 6. No incluyas imágenes o links.

# gemini_create_lesson_prompt
source: Generate a new lesson for the course '{courseTitle}'. Here is a summary of the last lessons: {summary} Continue the course with a new lesson related to these topics.Expected structure for a lesson continuation: { "title": "Title of the next lesson", "content": "Detailed content for the entire lesson, with clear examples", "progress": 0.0, "game": [ { "question": "Question 1", "response": [ "Answer 1", "Answer 2", "Answer 3", "Answer 4", "Answer 5" ], "solution": "Answer 1" } ] }
es: Genera una nueva lección para el curso '{courseTitle}'. Aquí tienes un resumen de las últimas lecciones: {summary} Continúa el curso con una nueva lección relacionada con estos temas.

# gemini_is_inappropriate_prompt
source: Is the topic '{topic}' inappropriate according to GeminiAIs standards? the response should follow this JSON format: { "reason": "Explanation of why the topic is inappropriate or if it is not", "value": "true or false (this is a boolean)" }
es: ¿El tema de {topic} es inapropiado según los cánones de GeminiAI? la respuesta debe seguir el siguiente formato JSON: { "reason": "motivo explicando por qué es inapropiado o si no lo es", "value": "true o false (esto es un booleano)" }

# create_course_inappropriate_error
source: The topic you want to learn is inappropriate
es: El tema que deseas aprender es inapropiado

# create_course_inappropriate_warning
source: Inappropriate topics are not allowed
es: Los temas inapropiados no están permitidos

# total_lessons
source: {totalLessons} lesson(s)
es: {totalLessons} lección(es)

# welcome_text
source: Welcome to
es: Bienvenido a

# enter_topic_hint
source: Enter a topic to learn
es: Ingresa un tema para aprender

source: Your courses
es: Tus cursos

# unbookmark_course_title
source: Unbookmark Course
es: Desmarcar Curso

# unbookmark_course_text
source: Are you sure you want to unbookmark this course? Please note that this will remove the course from your Firebase account and you won't be able to recover it.
es: ¿Estás seguro de que quieres desmarcar este curso? Ten en cuenta que esto eliminará el curso de tu cuenta de Firebase y no podrás recuperarlo.

# delete_course_title
source: Delete course
es: Eliminar curso

# delete_course_text
source: Are you sure you want to delete this course? This will permanently remove the course from this app, and it will no longer appear in your courses list, unless you bookmark it and save it to your account.
es: ¿Estás seguro de que quieres eliminar este curso? Esto eliminará permanentemente el curso de esta aplicación, y ya no aparecerá en tu lista de cursos, a menos que lo marques y lo guardes en tu cuenta.

# yes_button
source: Yes
es: Sí

# course_deleted_message
source: Course successfully deleted
es: Curso eliminado con éxito

# incomplete_lessons_alert_text
source: You have {lessonsIncomplete} incomplete lessons. Complete them to generate more.
es: Tienes {lessonsIncomplete} lecciones incompletas. Completalas para generar más.

# delete_course
source: Delete
es: Eliminar

source: Description
es: Descripción

source: Lessons
es: Lecciones

source: Course Overview
es: Vista general del curso

source: Overall Progress
es: Progreso general

# continue_where_left_off
source: Continue where you left off
es: Continúa donde lo dejaste

source: Generate new Lesson
es: Generar nueva lección

# course_completed
source: complete - {completedLessons} of {totalLessons} lessons completed
es: completo - {completedLessons} de {totalLessons} lecciones completadas

# start_game_label
source: Start Game
es: Iniciar Juego

# complete_lesson_text
source: Complete Lesson
es: Completar Lección

# no_lessons_saved
source: You haven't saved any lessons yet
es: Aún no ha guardado ninguna lección

# play_again_button
source: Play Again
es: Jugar de Nuevo

# back_to_lesson_button
source: Back to Lesson
es: Volver a la Lección

# completion_label
source: Completion
es: Finalización

# total_question_label
source: Total Questions
es: Total de Preguntas

# correct_label
source: Correct
es: Correctas

# wrong_label
source: Wrong
es: Incorrectas

# correct_answer_prefix
source: Correct Answer:
es: Respuesta Correcta:

# select_answer_warning
source: You must select an answer to continue.
es: Debes seleccionar una respuesta para continuar.

# question_progress
source: Question {current}/{total}
es: Pregunta {current}/{total}

# previous_button
source: Previous
es: Anterior

# submit_button
source: Submit
es: Enviar

# next_button
source: Next
es: Siguiente

# quit_quiz_warning_message
source: Are you sure you want to quit the quiz? All your progress will be lost.
es: ¿Estás seguro de que quieres salir del cuestionario? Todo tu progreso se perderá.

# quit_quiz_warning_title
source: Warning!
es: ¡Advertencia!

# quiz_title
source: Quiz
es: Cuestionario

# statistic_courses
source: Cursos
es: Courses

# button_start
source: Start
es: Comenzar

# snackbar_error_message
source: Oops... Something went wrong
es: Ups... Algo salió mal

# continue_as_guest_button
source: Continue as guest
es: Continuar como invitado

# log_in_with_google_button
source: Log in with Google
es: Iniciar sesión con Google

# user_name
source: Guest
es: Invitado

# preferences_label
source: PREFERENCES
es: PREFERENCIAS

# language_option
source: Language
es: Idioma

# dark_mode_option
source: Dark Mode
es: Modo Oscuro

# account_label
source: ACCOUNT
es: CUENTA

# help_option
source: Frequently Asked Questions
es: Preguntas Frecuentes

# logout_option
source: Logout
es: Cerrar Sesión

# idiom_text
source: English
es: Español

# faq_what_is_learnquest
source: What is LearnQuest?
es: ¿Qué es LearnQuest?

# faq_what_is_learnquest_answer
source: LearnQuest is an innovative app designed to provide a personalized learning experience, offering interactive courses in various disciplines that allow you to progress at your own pace.
es: LearnQuest es una aplicación innovadora diseñada para ofrecer una experiencia de aprendizaje personalizada, con cursos interactivos en diversas disciplinas que te permiten avanzar a tu propio ritmo.

# faq_how_does_learnquest_work
source: How does LearnQuest work?
es: ¿Cómo funciona LearnQuest?

# faq_how_does_learnquest_work_answer
source: LearnQuest uses advanced artificial intelligence technology to tailor educational content to your needs. You can follow interactive lessons, track your progress, and learn anytime, anywhere.
es: LearnQuest utiliza tecnología avanzada de inteligencia artificial para adaptar el contenido educativo a tus necesidades. Puedes seguir lecciones interactivas, realizar un seguimiento de tu progreso y aprender en cualquier momento y lugar.

# faq_need_internet
source: Do I need to be connected to the Internet to use LearnQuest?
es: ¿Es necesario estar conectado a Internet para usar LearnQuest?

# faq_need_internet_answer
source: Yes, an Internet connection is required to access the courses and lessons. However, we are working on implementing offline access features in future updates.
es: Sí, se requiere una conexión a Internet para acceder a los cursos y lecciones. Sin embargo, estamos trabajando en implementar funciones de acceso sin conexión en futuras actualizaciones.

# faq_how_to_register
source: How can I register for LearnQuest?
es: ¿Cómo puedo registrarme en LearnQuest?

# faq_how_to_register_answer
source: You can register for LearnQuest using your email address or Google account. Simply download the app and follow the instructions to create your account.
es: Puedes registrarte en LearnQuest utilizando tu dirección de correo electrónico o tu cuenta de Google. Simplemente descarga la aplicación y sigue las instrucciones para crear tu cuenta.

# faq_is_learnquest_free
source: Is LearnQuest free?
es: ¿LearnQuest es una aplicación gratuita?

# faq_is_learnquest_free_answer
source: Currently, LearnQuest is free. We offer full access to courses and lessons at no additional cost.
es: Actualmente, LearnQuest es gratuito. Ofrecemos acceso completo a los cursos y lecciones sin costo adicional.

# faq_change_language
source: Can I change the language of the app?
es: ¿Puedo cambiar el idioma de la aplicación?

# faq_change_language_answer
source: Yes, LearnQuest is available in English and Spanish. You can change the language from the app's settings section.
es: Sí, LearnQuest está disponible en inglés y español. Puedes cambiar el idioma desde la sección de configuración de la aplicación.

# faq_track_progress
source: How can I track my progress?
es: ¿Cómo puedo hacer un seguimiento de mi progreso?

# faq_track_progress_answer
source: Each course in LearnQuest has a progress section where you can see how many lessons you've completed and how many are left.
es: Cada curso en LearnQuest tiene una sección de progreso donde puedes ver cuántas lecciones has completado y cuántas aún te quedan por completar.

# faq_multiple_devices
source: Can I access LearnQuest from multiple devices?
es: ¿Puedo acceder a LearnQuest desde varios dispositivos?

# faq_multiple_devices_answer
source: Yes, you can access your LearnQuest account from multiple devices. Just sign in with your account on each device to sync your progress.
es: Sí, puedes acceder a tu cuenta de LearnQuest desde múltiples dispositivos. Solo necesitas iniciar sesión con tu cuenta en cada dispositivo para sincronizar tu progreso.
